document.addEventListener("DOMContentLoaded", function () {
    const infoPopup = document.getElementById("infoPopup");
    const modalContent = infoPopup.querySelector(".modal-content"); // Оголошуємо modalContent тут
  
    // Обробник події для радіокнопок
    document.querySelectorAll('input[type="radio"]').forEach((radio) => {
      radio.addEventListener("change", (event) => {
        const selectedValue = event.target.value;
        showInfo(selectedValue);
      });
    });
  
  
// Функція відображення інформації в спливаючому вікні
function showInfo(infoType) {
  let infoText = "";
  if (infoType === "trends") {
    infoText = "<ul><h2>Тенденції веб розробки</h2><li>Мікросервісна архітектура: Зростання популярності мікросервісної архітектури веб-додатків, що дозволяє розбити систему на невеликі та незалежні " +
      "компоненти для підвищення масштабованості та обслуговування.</li>" +
      "<li>Однією з ключових тенденцій у веб-розробці є використання фреймворку React для створення інтерактивних та ефективних користувацьких інтерфейсів.</li>" +
      "<li>Progressive Web Apps (PWA) розвиваються як веб-додатки, які комбінують найкращі аспекти веб-сайтів і мобільних додатків. " +
      "Progressive Web Apps (PWA) розвиваються як веб-додатки, які комбінують найкращі аспекти веб-сайтів і мобільних додатків. " +
      "PWA автоматично оновлюються при наявності з'єднання з Інтернетом. PWA дозволяють залучити більше користувачів завдяки своїм мобільним можливостям " +
      "та зручностям використання. Вони стають альтернативою традиційним мобільним додаткам, не вимагаючи встановлення через магазини додатків.</li>" +
      "</ul>";
  } else if (infoType === "tips") {
    infoText = "<ul><h2>Практичні поради</h2><li>Використання Dev Tools: Активне використання інструментів розробника браузера та інших Dev Tools для відладки та оптимізації веб-додатків.</li>" +
      "<li>Застосування Postman: Використання Postman для тестування API, автоматизації запитів та перевірки правильності відповідей сервера.</li>" +
      "<li>Структура маршрутизації: Ретельне планування та реалізація системи маршрутизації для ефективного оброблення запитів та навігації у веб-додатку.</li>" +
      "</ul>";
  } else if (infoType === "devops") {
    infoText = "<ul><h2>Dev Ops - покращення співпраці між розробкою ПЗ та операційним впровадженням</h2><li>Контейнеризація: Kubernetes</li>" 
    "<li>Системи контролю версій Git.</li>" +
    "<li>Інструменти для кешування з метою зберегти швидкий доступ до даних такі як Redis або Memcached.</li>" +
    "<li>Веб сервер NGINX.</li>" +
    "<li>Інтеграція та постійна поставка (CI/CD): Jenkins, GitLab CI, CircleCI допомагають автоматизувати процеси інтеграції, тестування та розгортання програмного забезпечення.</li>" +
    "<li>Моніторинг та журналювання: Інструменти моніторингу, такі як Prometheus, Grafana, ELK Stack, дозволяють відстежувати продуктивність, доступність та відповідність додатків у реальному часі.</li>" +
    "<li>Спільні практики та культура: Включаючи Agile, Lean та інші методології розвитку програмного забезпечення, а також співпрацю та комунікацію між розробниками.</li>" +

    "</ul>"; 
  }


      modalContent.innerHTML = infoText;
      infoPopup.style.display = "block";
    }
  
    // Обробник події для модального вікна
    modalContent.addEventListener("click", function() {
      infoPopup.style.display = "none";
    });
  });
  

  